function factorial(input) {

/*     Напишете функция, която получава число и отпечатва на конзолата резултата от неговия факториел.
    Факториел е функция на цяло число, равна на произведението на всички естествени числа, по-малки или равни на него.
    Например факториел от 4 означава: 1*2*3*4 = 24. */
    


    let number = Number(input[0]);
    let result = 1; // начална стойност 1, защото ако е 0 всички резултати ще са 0 

    for (let currNum = 2; currNum <= number; currNum++) {
        result *= currNum;

    }
    console.log(result);

}
factorial(["4"])